In [1]:
import numpy as np
import pandas as pd

ðŸŸ¦ Part A: Pandas Series â€“ Practice Questions
ðŸ”¹ Level 1: Very Basic

Create a Pandas Series containing the numbers: 10, 20, 30, 40, 50.

Create a Series from a Python list of strings: ["apple", "banana", "cherry"].

Display the values and index of a Series.

Create a Series with custom index labels: a, b, c, d.

ðŸ”¹ Level 2: Operations & Indexing

Access the first and last element of a Series.

Select elements using index labels instead of positions.

Change the value at index 'b' to 100.

Perform element-wise addition on a Series (Series + 5).

Find the mean, max, and min of a numeric Series.

ðŸ”¹ Level 3: Logical & Missing Data

Filter values greater than 25 from a Series.

Create a Series with some missing values (NaN).

Check which values are missing.

Replace missing values with 0.

ðŸŸ© Part B: Pandas DataFrame â€“ Practice Questions
ðŸ”¹ Level 1: Creation & Viewing

Create a DataFrame from a dictionary:

{
  "Name": ["Rahim", "Karim", "Salma"],
  "Age": [20, 22, 21],
  "Marks": [85, 90, 88]
}


Display the first 2 rows of the DataFrame.

Display the last row of the DataFrame.

Print DataFrame shape, columns, and data types.

ðŸ”¹ Level 2: Column & Row Operations

Select only the "Name" column.

Select multiple columns: "Name" and "Marks".

Add a new column "Passed" where Marks â‰¥ 40 â†’ True, else False.

Rename column "Marks" to "Score".

Delete the "Age" column.

ðŸ”¹ Level 3: Indexing & Filtering

Select the row where Name is "Karim".

Filter students who scored more than 85.

Sort the DataFrame by "Marks" in descending order.

Reset the index after sorting.

ðŸ”¹ Level 4: Missing Data & Statistics

Insert a missing value in the "Marks" column.

Detect missing values in the DataFrame.

Fill missing marks with the average marks.

Find:

Average marks

Highest marks

Lowest marks

ðŸ§  Challenge (Good for ML Preparation)

Create a DataFrame of 5 students with:

Name

Math

Science

English

Then:

Calculate total marks

Calculate average marks

Find the top student

In [10]:
nums=[10, 20, 30, 40, 50]
fruits=["apple", "banana", "cherry"]

nums=pd.Series(nums)
fruits=pd.Series(fruits)

print(nums)
print(fruits)

0    10
1    20
2    30
3    40
4    50
dtype: int64
0     apple
1    banana
2    cherry
dtype: object

In [9]:
print(pd.Series(nums,index=['a', 'b', 'c', 'd','e']))

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [15]:
print(nums)
print("First element of series:",nums[0])
index=len(nums)
print("Last element of series:",nums[index-1])
print("Elements by using index labels:",nums.loc[0])

0    10
1    20
2    30
3    40
4    50
dtype: int64
First element of series: 10
Last element of series: 50
Elements by using index labels: 10

In [18]:
nums=[10, 20, 30, 40, 50]
data=pd.Series(nums,index=['a', 'b', 'c', 'd','e'])

data["b"]=100
data

a     10
b    100
c     30
d     40
e     50
dtype: int64

In [19]:
data+5

a     15
b    105
c     35
d     45
e     55
dtype: int64

In [20]:
print("Mean",data.mean())
print("Maximum",data.max())
print("Minimum",data.min())

Mean 46.0
Maximum 100
Minimum 10

In [31]:
import pandas as pd
import numpy as np

data = {
    "Student": ["A", "B", "C", "D", "E"],
    "Math": [85, 90, np.nan, 70, 88],
    "Physics": [np.nan, 92, 75, 80, np.nan],
    "Chemistry": [78, np.nan, 82, 76, 85],
    "Attendance": [90, 85, np.nan, 95, 88]
}

df = pd.DataFrame(data)
print(df)

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0
2       C   NaN     75.0       82.0         NaN
3       D  70.0     80.0       76.0        95.0
4       E  88.0      NaN       85.0        88.0

In [30]:
df[df["Math"]>80]
print(df)

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      NaN       78.0        90.0
1       B  90.0     92.0        NaN        85.0
4       E  88.0      NaN       85.0        88.0

In [35]:
df.isnull()
df.nunique()
df.fillna(0)

  Student  Math  Physics  Chemistry  Attendance
0       A  85.0      0.0       78.0        90.0
1       B  90.0     92.0        0.0        85.0
2       C   0.0     75.0       82.0         0.0
3       D  70.0     80.0       76.0        95.0
4       E  88.0      0.0       85.0        88.0

In [55]:
student={
  "Name": ["Rahim", "Karim", "Salma"],
  "Age": [20, 22, 21],
  "Marks": [85, 90, 88]
}
df=pd.DataFrame(student)
df.head(2)
df.tail()
df.shape
df.columns
df.info()
df["Name"]
df[["Name","Marks"]]
df=df.rename(columns={"Makrs":"Scores"})
df
# del(df["Age"])
# df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Marks   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

    Name  Age  Marks
0  Rahim   20     85
1  Karim   22     90
2  Salma   21     88

In [65]:
df[df["Name"]=="Karim"]
df[df["Marks"]>85]
df.sort_values(["Marks"],ascending=False)
df.reset_index()

   index   Name  Age  Marks
0      1  Karim   22     90
1      2  Salma   21     88